In [1]:
#Exercises
#For several of the following exercises, you'll need to load several datasets using the pydataset library. 
#(If you get an error when trying to run the import below, use pip to install the pydataset package.)

In [2]:
from pydataset import data
#When the instructions say to load a dataset, you can pass the name of the dataset as a string to the data 
#function to load the dataset. You can also view the documentation for the data set by passing the show_doc 
#keyword argument.


# data('mpg', show_doc=True) # view the documentation for the dataset
#mpg = data('mpg') # load the dataset and store it in a variable
#All the datasets loaded from the pydataset library will be pandas dataframes.

#Copy the code from the lesson to create a dataframe full of student grades.

SyntaxError: invalid syntax (3165282634.py, line 11)

In [3]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [5]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [7]:
#Create a column named passing_english that indicates whether each student has a passing grade in english.
df['passing_english'] = df['english']

In [8]:
df.head()

    name  math  english  reading  passing_english
0  Sally    62       85       80               85
1   Jane    88       79       67               79
2  Suzie    94       74       95               74
3  Billy    98       96       88               96
4    Ada    77       92       98               92

In [9]:
#Sort the english grades by the passing_english column. How are duplicates handled?
df.sort_values(by= 'passing_english')

       name  math  english  reading  passing_english
8    Albert    92       62       87               62
11     Alan    92       62       72               62
7     Marie    93       63       90               63
6    Thomas    82       64       81               64
2     Suzie    94       74       95               74
5      John    79       76       93               76
1      Jane    88       79       67               79
9   Richard    69       80       94               80
0     Sally    62       85       80               85
4       Ada    77       92       98               92
3     Billy    98       96       88               96
10    Isaac    92       99       93               99

In [10]:
#Sort the english grades first by passing_english and then by student name. All the students that are failing 
#english should be first, and within the students that are failing english they should be ordered alphabetically. 
#The same should be true for the students passing english. (Hint: you can pass a list to the .sort_values method)
df.sort_values(by= ['passing_english', 'name'])

       name  math  english  reading  passing_english
11     Alan    92       62       72               62
8    Albert    92       62       87               62
7     Marie    93       63       90               63
6    Thomas    82       64       81               64
2     Suzie    94       74       95               74
5      John    79       76       93               76
1      Jane    88       79       67               79
9   Richard    69       80       94               80
0     Sally    62       85       80               85
4       Ada    77       92       98               92
3     Billy    98       96       88               96
10    Isaac    92       99       93               99

In [11]:
#Sort the english grades first by passing_english, and then by the actual english grade, similar to how we did in
#the last step.
df.sort_values(by=['passing_english', 'english'])

       name  math  english  reading  passing_english
8    Albert    92       62       87               62
11     Alan    92       62       72               62
7     Marie    93       63       90               63
6    Thomas    82       64       81               64
2     Suzie    94       74       95               74
5      John    79       76       93               76
1      Jane    88       79       67               79
9   Richard    69       80       94               80
0     Sally    62       85       80               85
4       Ada    77       92       98               92
3     Billy    98       96       88               96
10    Isaac    92       99       93               99

In [35]:
df['mean_scoress'] = (df.math + df.english + df.reading)/3

In [36]:
#Calculate each students overall grade and add it as a column on the dataframe. The overall grade is the average 
#of the math, english, and reading grade
df

       name  math  english  reading  passing_english  mean_scoress
0     Sally    62       85       80               85     75.666667
1      Jane    88       79       67               79     78.000000
2     Suzie    94       74       95               74     87.666667
3     Billy    98       96       88               96     94.000000
4       Ada    77       92       98               92     89.000000
5      John    79       76       93               76     82.666667
6    Thomas    82       64       81               64     75.666667
7     Marie    93       63       90               63     82.000000
8    Albert    92       62       87               62     80.333333
9   Richard    69       80       94               80     81.000000
10    Isaac    92       99       93               99     94.666667
11     Alan    92       62       72               62     75.333333

In [38]:
#Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:
#data('mpg', show_doc=True) # view the documentation for the dataset
#mpg = data('mpg') # load the dataset and store it in a variable

NameError: name 'data' is not defined

In [39]:
from pydataset import data

In [41]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [43]:
mpg = data('mpg')

In [47]:
mpg.shape

(234, 11)

In [48]:
#How many rows and columns are there?
mpg.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [49]:
#What are the data types of each column?
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

In [52]:
#Summarize the dataframe with .info and .describe
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [53]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [54]:
#Rename the cty column to city.
mpg.rename(columns = {'cty': 'city'}, inplace=True)

In [58]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'city',
       'highway', 'fl', 'class'],
      dtype='object')

In [56]:
#Rename the hwy column to highway.
mpg.rename(columns = {'hwy': 'highway'}, inplace=True)

In [57]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'city',
       'highway', 'fl', 'class'],
      dtype='object')

In [88]:
#Do any cars have better city mileage than highway mileage?
mpg[mpg.city < mpg.highway].index.size

234

In [67]:
#Create a column named mileage_difference this column should contain the difference between highway and 
#city mileage for each car.
mpg['mileage_difference'] = mpg.highway - mpg.city
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [70]:
#Which car (or cars) has the highest mileage difference?
mpg[mpg.mileage_difference == mpg.mileage_difference.max()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,12
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12

In [78]:
#Which compact class car has the lowest highway mileage? The best?
compact = mpg[mpg['class']=='compact']
compact.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [82]:
compact.sort_values(by='highway', ascending=False).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11

In [83]:
compact.sort_values(by='highway', ascending=False).tail(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
220,volkswagen,jetta,2.8,1999,6,auto(l4),f,16,23,r,compact,7

In [87]:
#Create a column named average_mileage that is the mean of the city and highway mileage.
mpg['average_mileage'] = (mpg.highway + mpg.city)/2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [94]:
#Which dodge car has the best average mileage? The worst?
dodge = mpg[mpg['manufacturer']=='dodge']
dodge.sort_values(by='average_mileage').tail(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
38,dodge,caravan 2wd,2.4,1999,4,auto(l3),f,18,24,r,minivan,6,21.0

In [96]:
dodge.sort_values(by='average_mileage').head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
70,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,9,12,e,pickup,3,10.5

In [119]:
#Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:
Mammals = data('Mammals')
data('Mammals', show_doc=True)

Mammals

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Garland(1983) Data on Running Speed of Mammals

### Description

Observations on the maximal running speed of mammal species and their body
mass.

### Usage

    data(Mammals)

### Format

A data frame with 107 observations on the following 4 variables.

weight

Body mass in Kg for "typical adult sizes"

speed

Maximal running speed (fastest sprint velocity on record)

hoppers

logical variable indicating animals that ambulate by hopping, e.g. kangaroos

specials

logical variable indicating special animals with "lifestyles in which speed
does not figure as an important factor": Hippopotamus, raccoon (Procyon),
badger (Meles), coati (Nasua), skunk (Mephitis), man (Homo), porcupine
(Erithizon), oppossum (didelphis), and sloth (Bradypus)

### Details

Used by Chappell (1989) and Koenker, Ng and Portnoy (1994) to illustrate the
fitting of piecewise linear curves.

### Source

Garland, T. (1983) The relation between maximal running speed and body mass in
terrestrial mammals, _J. Zoology_, 199, 1557-1570.

### References

Koenker, R., P. Ng and S. Portnoy, (1994) Quantile Smoothing Splines”
_Biometrika_, 81, 673-680.

Chappell, R. (1989) Fitting Bent Lines to Data, with Applications ot
Allometry, _J. Theo. Biology_, 138, 235-256.

### See Also

`rqss`

### Examples

    data(Mammals)
    attach(Mammals)
    x <- log(weight)
    y <- log(speed)
    plot(x,y, xlab="Weight in log(Kg)", ylab="Speed in log(Km/hour)",type="n")
    points(x[hoppers],y[hoppers],pch = "h", col="red")
    points(x[specials],y[specials],pch = "s", col="blue")
    others <- (!hoppers & !specials)
    points(x[others],y[others], col="black",cex = .75)
    fit <- rqss(y ~ qss(x, lambda = 1),tau = .9)
    plot(fit)

In [176]:
Mammals.weight.head().max()

ValueError: No axis named 5 for object type Series

In [165]:
Mammals.columns

Index(['weight', 'speed', 'hoppers', 'specials'], dtype='object')

In [147]:
#How many rows and columns are there?
Mammals.shape

(107, 4)

In [120]:
#What are the data types?
Mammals.dtypes

weight      float64
speed       float64
hoppers        bool
specials       bool
dtype: object

In [121]:
#Summarize the dataframe with .info and .describe
Mammals.describe()

            weight       speed
count   107.000000  107.000000
mean    278.688178   46.208411
std     839.608269   26.716778
min       0.016000    1.600000
25%       1.700000   22.500000
50%      34.000000   48.000000
75%     142.500000   65.000000
max    6000.000000  110.000000

In [122]:
Mammals.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 107 entries, 1 to 107
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   weight    107 non-null    float64
 1   speed     107 non-null    float64
 2   hoppers   107 non-null    bool
 3   specials  107 non-null    bool
dtypes: bool(2), float64(2)
memory usage: 2.7 KB

In [149]:
#What is the the weight of the fastest animal?
Mammals.weight

1      6000.000
2      4000.000
3      3000.000
4      1400.000
5       400.000
6       350.000
7       300.000
8       260.000
9       250.000
10     3800.000
11     1000.000
12      900.000
13      900.000
14      800.000
15      750.000
16      500.000
17      450.000
18      300.000
19      300.000
20      250.000
21      250.000
22      170.000
23      150.000
24      130.000
25      120.000
26      120.000
27      110.000
28      100.000
29       85.000
30       80.000
31       72.000
32       70.000
33       65.000
34       62.000
35       50.000
36       50.000
37       50.000
38       50.000
39       37.000
40       35.000
41       34.000
42       30.000
43       30.000
44       30.000
45       20.000
46      400.000
47      300.000
48      230.000
49      150.000
50      135.000
51       65.000
52       60.000
53       55.000
54       45.000
55       40.000
56       25.000
57       20.000
58       16.000
59       12.000
60       11.000
61       10.000
62        7.000
63        6.000
64        5.000
65        5.000
66        3.000
67      127.000
68       70.000
69       13.000
70        9.000
71        4.000
72        0.600
73        0.600
74        0.550
75        0.500
76        0.400
77        0.300
78        0.250
79        0.220
80        0.110
81        0.100
82        0.056
83        0.050
84        0.045
85        0.035
86        0.035
87        0.030
88        0.030
89        0.025
90        0.025
91        0.018
92        0.016
93        0.100
94        0.100
95        0.016
96        4.600
97        4.400
98        4.000
99        3.500
100       2.000
101       1.900
102       1.500
103       1.500
104      50.000
105       5.000
106       0.024
107       4.000
Name: weight, dtype: float64

In [154]:
fast= Mammals.speed
fast.max()

110.0

In [161]:
speedy = Mammals.speed == 110

In [130]:
compact = mpg[mpg['class']=='compact']
compact.sort_values(by='highway', ascending=False).head(1)

KeyError: 110.0

In [185]:
#What is the overal percentage of specials?
#Mammals['specials_pct'] = Mammals['specials']/((Mammals.specials.count()) * 100)
#Mammals['specials_pct']

weight          10
speed           10
hoppers         10
specials        10
specials_pct    10
dtype: int64

In [ ]:
nba_df['win_pct'] = nba_df['wins']/(nba_df['wins']+nba_df['losses'])*100

In [162]:
#How many animals are hoppers that are above the median speed? What percentage is this?
Mammals.hoppers.count()

107

In [ ]:
#Awesome Bonus
#For much more practice with pandas, Go to https://github.com/guipsamora/pandas_exercises and clone the repo down 
#to your laptop. To clone a repository: - Copy the SSH address of the repository - cd ~/codeup-data-science - 
#Then type git clone git@github.com:guipsamora/pandas_exercises.git - Now do cd pandas_exercises on your terminal. - 
#Type git remote remove origin, so you won't accidentally try to push your work to guipsamora's repo.

#Congratulations! You have cloned guipsamora's pandas exercises to your computer. Now you need to make a new, 
#blank, repository on GitHub.

#Go to https://github.com/new to make a new repo. Name it pandas_exercises.
#DO NOT check any check boxes. We need a blank, empty repo.
#Finally, follow the directions to "push an existing repository from the command line" so that you can push up 
#your changes to your own account.
#Now do your own work, add it, commit it, and push it!